app/controllers/application_controller.rb

  def current_user
    # fetches the user we've logged in as
    return nil if self.session[:session_token].nil?
    User.find_by(session_token: self.session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "DXdpMpoY7HbKG7ACNaWdGQ"], ["LIMIT", 1]]