app/controllers/feeds_controller.rb

  def show
    @feed_tweets =
      current_user.feed_tweets(LIMIT, params[:max_created_at]).includes(:user)
---
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 11]]