app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello"], ["user_id", 8], ["created_at", "2021-12-22 04:16:34.880861"], ["updated_at", "2021-12-22 04:16:34.880861"]]
---
  def create
    # simulate latency
    sleep(1)

    @tweet = current_user.tweets.build(tweet_params)

    if @tweet.save