app/models/user.rb

SELECT "follows"."followee_id" FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 8]]
---
  def feed_tweets(limit = nil, max_created_at = nil)
    # max_created_at ||= Float::INFINITY
    @tweets = Tweet
      .joins(:user)
      .joins('LEFT OUTER JOIN follows ON users.id = follows.followee_id')
      .where('tweets.user_id = :id OR follows.follower_id = :id', id: self.id)
      .order('tweets.created_at DESC')
      .distinct
      .limit(limit)

    @tweets = @tweets.where('tweets.created_at < ?', max_created_at) if max_created_at